app/workers/csv_import_worker.rb

INSERT INTO "brands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Gislason, Stamm and Wehner"], ["created_at", "2023-09-17 10:05:08.328778"], ["updated_at", "2023-09-17 10:05:08.328778"]]
---
  def perform(file_path)
  	file_path = Rails.root.join('brands.csv')

    CSV.foreach(file_path, headers: true) do |row|
      # Add logic to process each row and create records as needed
      brand_name = row['name']
      Brand.create(name: brand_name)