app/admin/product_categories.rb

SELECT "product_masters".* FROM "product_masters"
SELECT "categories".* FROM "categories"
---

  form do |f|
    f.inputs do
      f.input :product_master, collection: ProductMaster.all
      f.input :category, collection: Category.all