app/admin/product_masters.rb

SELECT "brands".* FROM "brands"
---
  end

  filter :name
  filter :brand, as: :select, collection: Brand.all