app/api/v1.rb

      end
      route_param :id do
        get do
          product = ProductMaster.find_by(id: params[:id])
---
SELECT "product_masters".* FROM "product_masters" WHERE "product_masters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

      end
      route_param :id do
        get do
          brand = Brand.find_by(id: params[:id])
---
SELECT "brands".* FROM "brands" WHERE "brands"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

      end
      route_param :id do
        get do
          category = Category.find_by(id: params[:id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

      end
      route_param :id do
        get do
          retailer = Retailer.find_by(id: params[:id])
---
SELECT "retailers".* FROM "retailers" WHERE "retailers"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

      end
      route_param :id do
        get do
          product_category = ProductCategory.find_by(id: params[:id])
---
SELECT "product_categories".* FROM "product_categories" WHERE "product_categories"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

      end
      route_param :id do
        get do
          retailer_product = RetailerProduct.find_by(id: params[:id])
---
SELECT "retailer_products".* FROM "retailer_products" WHERE "retailer_products"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]