app/views/retailer_products/_form.html.erb

SELECT "product_masters".* FROM "product_masters"
---
    <%= form.label :product_master_id %>
    <%= form.collection_select :product_master_id, ProductMaster.all, :id, :name, prompt: 'Select a product' %>

SELECT "retailers".* FROM "retailers"
---
    <%= form.label :retailer_id %>
    <%= form.collection_select :retailer_id, Retailer.all, :id, :name, prompt: 'Select a retailer' %>