app/views/product_masters/_form.html.erb

    <%= form.label :brand_id %>
    <%= form.collection_select :brand_id, Brand.all, :id, :name, prompt: 'Select a brand' %>
---
SELECT "brands".* FROM "brands"