app/views/product_categories/_form.html.erb

    <%= form.label :product_master_id %>
    <%= form.collection_select :product_master_id, ProductMaster.all, :id, :name, prompt: 'Select a product' %>
---
SELECT "product_masters".* FROM "product_masters"

    <%= form.label :category_id %>
    <%= form.collection_select :category_id, Category.all, :id, :name, prompt: 'Select a category' %>
---
SELECT "categories".* FROM "categories"