app/controllers/brands_controller.rb

  def create
    @brand = Brand.new(brand_params)

    if @brand.save
---
INSERT INTO "brands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "realm"], ["created_at", "2023-09-12 12:46:47.402061"], ["updated_at", "2023-09-12 12:46:47.402061"]]

  def update
    if @brand.update(brand_params)
---
UPDATE "brands" SET "name" = $1, "updated_at" = $2 WHERE "brands"."id" = $3  [["name", "realme"], ["updated_at", "2023-09-12 12:48:00.151516"], ["id", 1]]

  def set_brand
    @brand = Brand.find(params[:id])
---
SELECT "brands".* FROM "brands" WHERE "brands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]