app/controllers/product_categories_controller.rb

  def index
    @product_categories = ProductCategory.all
---
SELECT "product_categories".* FROM "product_categories"

  def create
    @product_category = ProductCategory.new(product_category_params)

    if @product_category.save
---
INSERT INTO "product_categories" ("product_master_id", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["product_master_id", 1], ["category_id", 1], ["created_at", "2023-09-12 12:49:48.766286"], ["updated_at", "2023-09-12 12:49:48.766286"]]

  def set_product_category
    @product_category = ProductCategory.find(params[:id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "product_categories".* FROM "product_categories" WHERE "product_categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]