app/controllers/product_masters_controller.rb

SELECT "product_masters".* FROM "product_masters"
---
  def index
    @product_masters = ProductMaster.all

INSERT INTO "product_masters" ("name", "description", "price", "brand_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @product_master = ProductMaster.new(product_master_params)

    if @product_master.save

SELECT "product_masters".* FROM "product_masters" WHERE "product_masters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_product_master
    @product_master = ProductMaster.find(params[:id])