app/controllers/retailers_controller.rb

SELECT "retailers".* FROM "retailers"
---
  def index
    @retailers = Retailer.all

INSERT INTO "retailers" ("name", "location", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "New Retailer"], ["location", "D Ground"], ["created_at", "2023-09-12 12:51:23.320628"], ["updated_at", "2023-09-12 12:51:23.320628"]]
---
  def create
    @retailer = Retailer.new(retailer_params)

    if @retailer.save

SELECT "retailers".* FROM "retailers" WHERE "retailers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_retailer
    @retailer = Retailer.find(params[:id])