app/controllers/retailer_products_controller.rb

SELECT "retailer_products".* FROM "retailer_products"
---
  def index
    @retailer_products = RetailerProduct.all